//Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
/*
 void PrintNumbers(int num)
 {   
     if (num > 0)
     {  
        Console.Write(num + " ");
        PrintNumbers(num - 1);
    }
     
 }

 Console.Write("Input a number: ");
 int n = Convert.ToInt32(Console.ReadLine());
 PrintNumbers(n);
 */

